Repository: valentinwinkelmann/vxelements-video_on_scroll
Catalog: vaax-elements-*.po
Languages: de_de

source: Distance
de_de: Distanz

source: Elementor Extension for VideoOnScroll effects
de_de: Elementor Erweiterung für VideoOnScroll Effekte

source: How deep must the page be scrolled for the video to have played 100%. You can specify a value in pixels or in percent, with percent 100% corresponds to the height of the actual video element.
de_de: Wie tief muss die Seite gescrollt werden, damit das Video zu 100 % abgespielt wurde. Sie können einen Wert in Pixel oder in Prozent angeben, wobei 100% der Höhe des eigentlichen Videoelements entspricht.

source: No
de_de: Nein

source: Not all videos are suitable for scrubbing. Stuttering will occur with many video formats. We recommend to use ffmpeg to convert the video into single generic frames before. You can do this in ffmpeg as follows: <br><code>ffmpeg -i input.mp4 -g 10 output.mp4</code>
de_de: Nicht alle Videos sind für das Scrubbing geeignet. Bei vielen Videoformaten kommt es zu Stottern. Wir empfehlen, das Video vorher mit ffmpeg in generische Einzelbilder zu konvertieren. Dies können Sie in ffmpeg wie folgt tun: <br><code>ffmpeg -i input.mp4 -g 10 output.mp4</code>

source: Refresh Rate
de_de: Aktualisierungsrate

source: Screen Offset
de_de: Bildschirm Abstand

source: Smoothing Time
de_de: Bewegungs Weichzeit

source: VAAX Multimeida Agency
de_de: VAAX Multimedia Agentur

source: Where is the screen trigger located? 0% is at the top of the screen, 100% is at the bottom of the screen, 50% is in the middle.
de_de: Wo befindet sich der Bildschirm-Trigger? 0 % ist am oberen Rand des Bildschirms, 100 % ist am unteren Rand des Bildschirms, 50 % ist in der Mitte.

source: Yes
de_de: Ja
